#---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
# Задача 30:  Заполните массив элементами арифметической прогрессии. Её первый элемент, разность и количество элементов нужно ввести с клавиатуры. 
# Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.
# Ввод: 7 2 5
# Вывод: 7 9 11 13 15

# a = int(input("Введите первый элемент: "))
# d = int(input("Введите разность: "))
# n = int(input("Введите количество элементов: "))

# lst = [a+(i-1)*d for i in range(1,n+1)]
# print(lst)


#---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
# Задача 31: Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)
# Ввод:  [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# 5
# 15
# Вывод: [1, 9, 13, 14, 19]

# def CheckRange(l, r, lst):
#     listResult = []
#     j = 0
#     for i in lst:
#         if i>l and i<r:
#             listResult.append(j)
#         j += 1
#     return listResult

# lst = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# l = int(input("Введите левую границу диапазона: "))
# r = int(input("Введите правую границу диапазона: "))

# print(CheckRange(l, r, lst))


#---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
# Задача 32:  Напишите программу, которая на вход принимает два числа A и B, и возводит число А в целую степень B с помощью рекурсии.
# A = 3; B = 5 -> 243 (3⁵)
# A = 2; B = 3 -> 8

def Deg (a, b, result):
    if b==1:
        return result
    return Deg(a, b-1, result * a)

a = int(input("Введите число А: "))
b = int(input("Введите число В: "))

print (Deg(a, b, a))